/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   strchr.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/02 12:13:19 by tchariss          #+#    #+#             */
/*   Updated: 2020/12/10 12:05:39 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <string.h>
#include <stdio.h>

// char	*ft_strchr(const char *s, int c)
/*
s – указатель на строку, в которой будет осуществляться поиск.
c – код искомого символа
*/
// Dозвращает указатель на первое вхождение символа(c) в строку(s)
// Функция strchr ищет первое вхождения символа, код которого указан в аргументе c, в строке, на которую указывает аргумент s.
// {
// 	int a;

// 	a = 0;
// 	if ( c == '\0')
// 	{
// 		while(s[a] != '\0')
// 			a++;
// 		return ((char *)&s[a]);
// 	}
// 	while(s[a] != '\0')
// 	{
// 		if ( s[a] == c )
// 			return ((char *)&s[a]);
// 		a++;
// 	}
// 	return 0;
// }

char	*ft_strchr(const char *s, int c)
{
	while (*s != '\0')
	{
		if (*s == c && c != '\0')
			return ((char *)s);
		s++;
	}
	return (NULL);
}


// int main()
// {
//     char s[11] = "0123456789"; // массив со строкой для поиска
//     int c = '6'; // код искомого символа 
//     char *in_c; // указ. на искомую переменную в строке, кот будет осуществляться поиск
                                                                                                                                                                          
//     in_c = ft_strchr (s, c); // ищем смивол 6

//     if (in_c == NULL)
//       printf("Символ в строке не найден\n");
//     else
//       printf("%s%s\n", "Искомый символ в строке на позиции\n" , in_c);

//    return 0;
// } 
