/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   strdup.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/01 18:05:15 by tchariss          #+#    #+#             */
/*   Updated: 2020/12/03 12:50:39 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <string.h>
#include <stdlib.h>

char	*strdup(const char *s1)
/* Функция strdup дублирует строку, на которую указывает аргумент s1. 
Память под дубликат строки выделяется с помощью функции malloc, и 
( если будет работать с ней , тооо) по окончанию работы с дубликатом должна быть очищена с помощью функции free */
{
	size_t	len;
	char	*s2;
	int a;
	int b;

	a = 0;
	b = 0;
	len = strlen(s1);
	s2 = malloc(sizeof(char) * (len + 1));
	if (s2 == NULL) // если вызов памяти неуспешен or не была выделена память
		return (NULL);
	while (s1[a] != '\0')
	{
		s2[b] = s1[a];
		a++;
		b++;
	}
	s2[b] = '\0';
	return (s2);
}

size_t	strlen(const char *s) //** возвращает длину строки
{
	size_t i;

	i = 0;
	while (s[i] != '\0')
	{
		i++;
	}
	return (i);
}

//  Можно заводить или не заводить второй счетчик
/*
int main()
{
	char s1[] = "Vikolleta";
	char *s2;

	printf("%s%s\n", "Скопированная строка : ", ft_strdup(s1));
	return (0);
}
*/