/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   strnew.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/02 14:06:50 by tchariss          #+#    #+#             */
/*   Updated: 2020/12/02 15:49:07 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <string.h>
#include <stdlib.h>
/*
Возвращает строку , оканчивающуюся на '\0', каждый символ инициализируется как '\0'
*/
char	*strnew(size_t size)
{
	char	*s;
	size_t	a;

	a = 0;
	s = malloc(sizeof(char) * size + 1);
	if (s == (NULL))
		return (NULL);
	while (a < size)
	{
		s[a] = '\0';
		a++;
	}
	return (s);
}